blog/how-to-tell-number-of-rows-changed-from-jdbc-execution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>当JDBC执行删改时，会返回什么值</title>
<!-- 2020-03-20 Fri 23:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">当JDBC执行删改时，会返回什么值</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 扩展</a></li>
</ul>
</div>
</div>
<p>
由于之前写PHP时，在做更新操作时，成功返回1，失败返回-1，无影响返回0。
前两天用Java语言写更新操作时，却掉坑里了。
</p>

<pre class="example">
jdbc:mysql://${jdbc.host}/${jdbc.db}?useAffectedRows=true
</pre>

<p>
根据连接串配置，如果useAffectedRows等于true
</p>

<pre class="example">
成功：
返回实际更新的行数
无更新（影响）返回0

失败：
会报异常
</pre>

<p>
如果useAffectedRows等于false，默认等于false。
</p>

<pre class="example">
成功：
返回更新的行数，无论有没有真正修改数据。

失败：
会报异常
</pre>

<p>
结论：
</p>
<ol class="org-ol">
<li>我们不能通过简单判断，觉得大于0就是更新成功，还需要根据useAffectedRows是true或着false来决定。
</li>
<li>判断失败是根据Checked Exception（CE）来决定，而不是根据else条件。
</li>
</ol>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 扩展</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>实际场景中，我们现在已经设置useAffectedRows=true，那怎么注意避免踩坑呢？
</li>
</ol>
<p>
答：因为useAffectedRows等于true，所以在做单字段更新时，如果给定值和数据库字段值一致，则返回0这种情况。我们可以避免更新单字段，而是一起更新多个字段，比如更新人，更新时间等。这样就可以避免返回0的情况。
删除时，可以先查询数据是否存在。如果不存在，则不用删除，也可以避免返回0的情况。
</p>

<ol class="org-ol">
<li>你觉得最好的方案是什么？
</li>
</ol>
<p>
答: 个人目前觉得最好的方案还是在底层封装下。调用更新删除，底层封装大于等于0就是更新成功返回1，否则异常返回-1。当然也可以根据上面说的PHP方案在做更新操作时，成功返回1，失败返回-1，无影响返回0。如果你有不同的见解或想法也欢迎留言讨论。 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>